{
	"articles": [
		{
			"id": 0,
			"title": "The PHP Practitioner",
			"description": "We all start somewhere. When it comes to web development with PHP, well, your first stop is this series. Designed specifically and exclusively for beginners, here, you'll learn the fundamentals of PHP - all the way down to defining variables and arrays.",
			"url": "https://laracasts.com/series/php-for-beginners",
			"done": false
		},
		{
			"id": 1,
			"title": "OOP Principles in PHP",
			"description": "The typical beginner, whether they realize it or not, first learns procedural programming. But, before too long, they level up. Suddenly, an entirely different paradigm is introduced: object-oriented programming. Little do they know that they'll spend years researching and learning exactly what it means to work with objects and messages. \nIn this series, you'll be introduced to the core principles of object-oriented programming in PHP. We'll begin with the basic constructs and work our way up.",
			"url": "https://laracasts.com/series/object-oriented-principles-in-php",
			"done": false
		},
		{
			"id": 2,
			"title": "OOP Principles in PHP",
			"description": "SOLID represents a series of guidelines that developers can use to, if done well, simplify and clarify their code. While certainly not laws, understanding these concepts will make you a better developer.",
			"url": "https://laracasts.com/series/solid-principles-in-php",
			"done": false
		},
		{
			"id": 3,
			"title": "Design Patterns in PHP",
			"description": "A design pattern is a common solution to a common problem. Nothing more, nothing less. And, while some of these approaches might seem foreign or overwhelming to you, the important thing to remember is that, as a developer, you are in charge. That means you decide when a pattern is appropriate, and when it's completely unnecessary. That's the key.",
			"url": "https://laracasts.com/series/design-patterns-in-php",
			"done": false
		}
	],
	"videos": [
		{
			"id": 0,
			"title": "PHP For Absolute Beginners | 6.5 Hour Course",
			"url": "https://www.youtube.com/watch?v=2eebptXfEvw",
			"done": false
		}
	],
	"books": [
		{
			"id": 0,
			"title": "PHP The Right Way",
			"url": "https://phptherightway.com/",
			"authors": ["Josh Lockhart", "Phil Sturgeon"],
			"description": "PHP: The Right Way is an easy-to-read, quick reference for PHP popular coding standards, links to authoritative tutorials around the Web and what the contributors consider to be best practices at the present time.",
			"pages": 0,
			"tags": ["php", "fundamentals", "advanced", "concepts", "docs"],
			"done": false
		}
	]
}
